1.	ვერსიის კონტროლი არის პროგრამა, რომელიც გვაძლევს საშუალებას, შევინახოთ ჩვენი ფაილები
და განვაახლოთ ისინი, ერთ-ერთი მათგანია Git.
2. კონკრეტული მონაცემების დამალვა რაზეც იუზერი გარედან ვერ მიიღებს წვდომას.
ანუ კონკრეტულ კლასს რო გადაცემ მშობლად სხვა კლასს და იმ კლასის ფუნქციები არ ჩანს ამ კლასში

3. ენკაფსულაციას ვიყენებთ მაშინ, როცა არ გვინდა, რომ მეთოდს მივწვდეთ კლასის გარედან.
4. Sql ცხრილში შეგვიძლია ველის უნიკალურობა ვუზრუნველყოთ unique პარამეტრის საშუალებით

5. Web framework არის მოდული, რომელიც გვეხმარება მარტივად გვქონდეს კომუნიკაცია მომხმარებელსა და სერვერს შორის.

6. უნდა გავითვალისწინოთ, რომ ის არის სრულყოფილი და მუშაობს თუ არა ბაზა და ვუკავშირდებით თუ არა სწორად.

7. 	თუ მონაცემთა ბაზებთან გვინდა დაკავშირება, კოდი რო არ ვაორმაგოთ ტყუილად, Flask-ით შევქმნით
ფუნქციებს და ყველა მოთხოვნის მერე გამოვიძახებთ.
მაგ:
after_request
teardown_request
before_first_request
before_first_request

